app/controllers/chirrps_controller.rb

SELECT "chirrps".* FROM "chirrps" ORDER BY created_at DESC
---
    def index
        @chirrps = Chirrp.all